Documents/СчетНаОплату.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>СчетНаОплату</Name>
			<Comment>Счет на оплату</Comment>
			<BasedOn>
				<xr:Item>Document.РеализацияТоваровИУслуг</xr:Item>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
				<xr:Item>Document.ЗаказДоговор</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УДАЛИТЬ_ОплатаПоСчетам</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоЗаказам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРучнойСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентРучнойСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Потолок</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Бесплатно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРучнойСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентРучнойСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Потолок</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Бесплатно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДокументыОснования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/РасчетыПоЗаказам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыПоЗаказам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/СчетНаОплату/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработкаСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	//проверки
	Для каждого ТекущаяСтрока из Услуги Цикл
		СтруктураПараметров = Новый Структура("Ссылка, ТабличнаяЧасть, ИмяТабличнойЧасти, НомерСтроки", ЭтотОбъект, "Услуги", "Услуги", ТекущаяСтрока.НомерСтроки);
		ОбработкаТабличныхЧастейСервер.ПроверитьЦенуСтроки(ТекущаяСтрока, СтруктураПараметров, Отказ);
	КонецЦикла;
	//Для Индекс = 0 по Услуги.Количество()-1 Цикл
	//	СтрокаТовар = Услуги.Получить(Индекс);
	//	Если Не ЗначениеЗаполнено(СтрокаТовар.Цена) и НЕ СтрокаТовар.Номенклатура.РазрешитьПродажуПоНулевойЦене Тогда
	//		Сообщение = Новый СообщениеПользователю();
	//		Сообщение.Текст = "В услугах в строке " + (Индекс+1) + " не заполнено значение цена";
	//		Сообщение.Поле = "Услуги[" + Индекс + "].Цена";
	//		Сообщение.УстановитьДанные(ЭтотОбъект);
	//		Сообщение.Сообщить();
	//		Отказ = Истина;
	//	КонецЕсли;
	//КонецЦикла;
	Для каждого ТекущаяСтрока из Товары Цикл
		СтруктураПараметров = Новый Структура("Ссылка, ТабличнаяЧасть, ИмяТабличнойЧасти, НомерСтроки", ЭтотОбъект, "Товары", "Товары", ТекущаяСтрока.НомерСтроки);
		ОбработкаТабличныхЧастейСервер.ПроверитьЦенуСтроки(ТекущаяСтрока, СтруктураПараметров, Отказ);
	КонецЦикла;	
	//Для Индекс = 0 по Товары.Количество()-1 Цикл
	//	СтрокаТовар = Товары.Получить(Индекс);
	//	Если Не ЗначениеЗаполнено(СтрокаТовар.Цена) и НЕ СтрокаТовар.Номенклатура.РазрешитьПродажуПоНулевойЦене Тогда
	//		Сообщение = Новый СообщениеПользователю();
	//		Сообщение.Текст = "В товарах в строке " + (Индекс+1) + " не заполнено значение цена";
	//		Сообщение.Поле = "Товары[" + Индекс + "].Цена";
	//		Сообщение.УстановитьДанные(ЭтотОбъект);
	//		Сообщение.Сообщить();
	//		Отказ = Истина;
	//	КонецЕсли;
	//КонецЦикла;
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Константы.ВестиРасчетыПоЗаказамПоСчетуНаОплату.Получить() Тогда
		Движения.РасчетыПоЗаказам.Записывать = Истина;
		Движение = Движения.РасчетыПоЗаказам.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Заказ = Ссылка;
		Движение.Сумма = СуммаДокумента;
		Движение.Контрагент = Контрагент; // №6496 добавлен контрагент в измерение
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипДанныхЗаполнения = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("МассивДокументов") Тогда
			Если ДанныеЗаполнения.МассивДокументов.Количество() > 0 Тогда
				Если ТипЗнч(ДанныеЗаполнения.МассивДокументов[0]) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
					ЗаполнитьПоЗаказуПокупателя(ДанныеЗаполнения.МассивДокументов);
				ИначеЕсли ТипЗнч(ДанныеЗаполнения.МассивДокументов[0]) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") Тогда
					ЗаполнитьПоРеализацииТоваровИУслуг(ДанныеЗаполнения.МассивДокументов);
				ИначеЕсли ТипЗнч(ДанныеЗаполнения.МассивДокументов[0]) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
					ЗаполнитьПоЗаказДоговору(ДанныеЗаполнения.МассивДокументов);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.РеализацияТоваровИУслуг") Тогда
		ЗаполнитьПоРеализацииТоваровИУслуг(ДанныеЗаполнения);

	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ЗаполнитьПоЗаказуПокупателя(ДанныеЗаполнения);
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ЗаказДоговор") Тогда
		ЗаполнитьПоЗаказДоговору(ДанныеЗаполнения);
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("СписокЗначений") Тогда
		Для НомерОснования = 0 По ДанныеЗаполнения.Количество()-1 Цикл
			Основание = ДанныеЗаполнения.Получить(НомерОснования).Значение;
			
			Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда			
				ЗаполнитьПоЗаказуПокупателя(Основание);				
			КонецЕсли;
			
			Если НЕ НомерОснования = ДанныеЗаполнения.Количество()-1 Тогда
				//в таблицу оснований добавляем все основания кроме последнего, так как он указан в шапке
				НоваяСтрока = ДокументыОснования.Добавить();
				НоваяСтрока.Документ = ДанныеЗаполнения.Получить(НомерОснования).Значение;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Документы.ЗаказПокупателя.ПроверитьЗаполнениеНаОснованииЗаказа(ЭтотОбъект, Отказ, РежимЗаписи);
	
КонецПроцедуры

#КонецОбласти

#Область Заполнение

Процедура ЗаполнитьПоРеализацииТоваровИУслуг(ДанныеЗаполнения)

	МассивДокументов = Новый Массив;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") Тогда
		МассивДокументов.Добавить(ДанныеЗаполнения);		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Массив") Тогда
		МассивДокументов 	= ДанныеЗаполнения;
	Иначе
		Возврат;
	КонецЕсли;
	
	Валюта 				= МассивДокументов[0].Валюта;
	ВидЦен 				= МассивДокументов[0].ВидЦен;
	ДоговорКонтрагента 	= МассивДокументов[0].ДоговорКонтрагента;
	//Комментарий 		= МассивДокументов[0].Комментарий; //#5849
	Контрагент 			= МассивДокументов[0].Контрагент;
	Организация 		= МассивДокументов[0].Организация;
	Основание 			= МассивДокументов[0];
	СуммаДокумента 		= 0; //ДанныеЗаполнения.СуммаДокумента;
	Для каждого ЭлементМассива из МассивДокументов Цикл
		Если Контрагент <> ЭлементМассива.Контрагент Тогда
			Текст = НСтр("ru = 'Контрагенты в выделенных документах различаются, создание счета невозможно'");			
			ВызватьИсключение Текст;
		КонецЕсли;
		Если Организация <> ЭлементМассива.Организация Тогда
			Текст = НСтр("ru = 'Организации в выделенных документах различаются, создание счета невозможно'");			
			ВызватьИсключение Текст;
		КонецЕсли;
		
		СуммаДокумента = СуммаДокумента + ЭлементМассива.СуммаДокумента;
		
		Для Каждого ТекСтрокаТовары Из ЭлементМассива.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаТовары);
			НоваяСтрока.Потолок = ?(Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(ТекСтрокаТовары.Номенклатура), ТекСтрокаТовары.Номенклатура, Неопределено);
		КонецЦикла;
		Для Каждого ТекСтрокаУслуги Из ЭлементМассива.Услуги Цикл
			НоваяСтрока = Услуги.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаУслуги);
		КонецЦикла;
	КонецЦикла;
	
	//в таблицу оснований добавляем все основания кроме первого, так как он указан в шапке
	Для Инд = 1 по МассивДокументов.Количество() - 1 Цикл
		НоваяСтрока = ДокументыОснования.Добавить();
		НоваяСтрока.Документ = МассивДокументов[Инд];
	КонецЦикла;	
	
КонецПроцедуры

Процедура ЗаполнитьПоЗаказуПокупателя(ДанныеЗаполнения)
	
	МассивДокументов = Новый Массив;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		МассивДокументов.Добавить(ДанныеЗаполнения);		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Массив") Тогда
		МассивДокументов 	= ДанныеЗаполнения;
	Иначе
		Возврат;
	КонецЕсли;
	
	Документы.ЗаказПокупателя.ПроверитьВозможностьВводаНаОснованииЗаказа(МассивДокументов, Истина);
	
	Валюта 				= МассивДокументов[0].Валюта;
	ВидЦен 				= МассивДокументов[0].ВидЦен;
	ДоговорКонтрагента 	= МассивДокументов[0].ДоговорКонтрагента;
	//Комментарий			= МассивДокументов[0].Комментарий; //#5849
	Контрагент 			= МассивДокументов[0].Контрагент;
	Организация 		= МассивДокументов[0].Организация;
	БанковскийСчет 		= Организация.ОсновнойБанковскийСчет;
	Основание 			= МассивДокументов[0];
	СуммаДокумента 		= 0; //ДанныеЗаполнения[0].СуммаДокумента;
	
	Для каждого ЭлементМассива из МассивДокументов Цикл
		Если Контрагент <> ЭлементМассива.Контрагент Тогда
			Текст = НСтр("ru = 'Контрагенты в выделенных документах различаются, создание счета невозможно'");			
			ВызватьИсключение Текст;
		КонецЕсли;
		
		СуммаДокумента = СуммаДокумента + ЭлементМассива.СуммаДокумента;
		
		Для Каждого ТекСтрокаТовары Из ЭлементМассива.Товары Цикл
			Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(ТекСтрокаТовары.Номенклатура) Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаТовары);
			
			//НоваяСтрока.СтавкаНДС = УчетНДС.СтавкаНДСПоУмолчанию(Организация);
			//НоваяСтрока.СуммаНДС = УчетНДС.РассчитатьСуммуНДС(НоваяСтрока.Сумма, УчетНДС.ОрганизацияЯвляетсяПлательщикомНДС(Организация), , УчетНДС.ПолучитьСтавкуНДС(НоваяСтрока.СтавкаНДС));	
		КонецЦикла;
		
		Для Каждого ТекСтрокаТовары Из ЭлементМассива.Товары Цикл
			Если НЕ Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(ТекСтрокаТовары.Номенклатура) Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрока = Услуги.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаТовары);		
		КонецЦикла;
	КонецЦикла;
	
	//в таблицу оснований добавляем все основания кроме первого, так как он указан в шапке
	Для Инд = 1 по МассивДокументов.Количество() - 1 Цикл
		НоваяСтрока = ДокументыОснования.Добавить();
		НоваяСтрока.Документ = МассивДокументов[Инд];
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьПоЗаказДоговору(ДанныеЗаполнения)
	
	МассивДокументов = Новый Массив;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
		МассивДокументов.Добавить(ДанныеЗаполнения);		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Массив") Тогда
		МассивДокументов 	= ДанныеЗаполнения;
	Иначе
		Возврат;
	КонецЕсли;
	
	Валюта 				= МассивДокументов[0].Валюта;
	ВидЦен 				= МассивДокументов[0].ВидЦен;
	Контрагент 			= МассивДокументов[0].Контрагент;
	ДоговорКонтрагента 	= МассивДокументов[0].ДоговорКонтрагента;
	//Комментарий 		= МассивДокументов[0].Комментарий; //#5849
	Организация 		= МассивДокументов[0].Организация;
	Основание 			= МассивДокументов[0];
	СуммаДокумента 		= МассивДокументов[0].СуммаДокумента;
	
	//в таблицу оснований добавляем все основания кроме первого, так как он указан в шапке
	Для Инд = 1 по МассивДокументов.Количество() - 1 Цикл
		НоваяСтрока = ДокументыОснования.Добавить();
		НоваяСтрока.Документ = МассивДокументов[Инд];
	КонецЦикла;
	
	ВременнаяТаблицаТоварыИУслуги = МассивДокументов[0].ТоварыУслуги.Выгрузить();
	ВременнаяТаблицаТоварыИУслуги.Очистить();

	Для каждого ЭлементМассива из МассивДокументов Цикл
		Если Контрагент <> ЭлементМассива.Контрагент Тогда
			Текст = НСтр("ru = 'Контрагенты в выделенных документах различаются, создание счета невозможно'");			
			ВызватьИсключение Текст;
		КонецЕсли;
		Для Каждого ТекущаяСтрока Из ЭлементМассива.ТоварыУслуги Цикл
			НоваяСтрока = ВременнаяТаблицаТоварыИУслуги.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		КонецЦикла;
	КонецЦикла;
	
	ВременнаяТаблицаТоварыИУслуги.Свернуть("Комната, Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, Коэффициент, Цена, ПроцентСкидки, СуммаСкидки","Количество, Сумма");
	ВременнаяТаблицаТоварыИУслуги.Сортировать("Комната");
	
	ТекущаяКомната = Неопределено;
	Для Каждого ТекущаяСтрока Из ВременнаяТаблицаТоварыИУслуги Цикл
		Если (ТекущаяСтрока.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Услуга) Тогда
			НоваяСтрока = Услуги.Добавить();
		Иначе
			НоваяСтрока = Товары.Добавить();
		КонецЕсли;
		
		// ищем потолок в комнате			
		Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(ТекущаяСтрока.Номенклатура) Тогда
			ТекущийПотолок = ТекущаяСтрока.Номенклатура;
		Иначе				
			Если ТекущаяСтрока.Комната <> ТекущаяКомната Тогда
				ТекущийПотолок = Неопределено;
				ПараметрыОтбора = Новый Структура("Комната", ТекущаяСтрока.Комната);
				НайденныеСтроки = ВременнаяТаблицаТоварыИУслуги.НайтиСтроки(ПараметрыОтбора);
				Для каждого Строка Из НайденныеСтроки Цикл
					Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(Строка.Номенклатура) Тогда
						ТекущийПотолок = Строка.Номенклатура;
						Прервать;					
					КонецЕсли; 				
				КонецЦикла;	
				ТекущаяКомната = ТекущаяСтрока.Комната;
			КонецЕсли; 
		КонецЕсли;
		
		НоваяСтрока.ЕдиницаИзмерения = ТекущаяСтрока.ЕдиницаИзмерения;
		НоваяСтрока.Количество = ТекущаяСтрока.Количество;
		НоваяСтрока.Коэффициент = ТекущаяСтрока.Коэффициент;
		НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
		НоваяСтрока.ХарактеристикаНоменклатуры = ТекущаяСтрока.ХарактеристикаНоменклатуры;
		НоваяСтрока.Сумма = ТекущаяСтрока.Сумма;
		НоваяСтрока.ПроцентРучнойСкидки = ТекущаяСтрока.ПроцентСкидки;
		НоваяСтрока.СуммаРучнойСкидки = ТекущаяСтрока.СуммаСкидки;
		НоваяСтрока.Цена = ТекущаяСтрока.Цена;
		НоваяСтрока.СтавкаНДС = УчетНДС.СтавкаНДСПоУмолчанию(Организация);
		НоваяСтрока.СуммаНДС = УчетНДС.РассчитатьСуммуНДС(НоваяСтрока.Сумма, УчетНДС.ОрганизацияЯвляетсяПлательщикомНДС(Организация), , УчетНДС.ПолучитьСтавкуНДС(НоваяСтрока.СтавкаНДС));
		
		НоваяСтрока.Потолок = ТекущийПотолок;
		
		СуммаДокумента = СуммаДокумента + НоваяСтрока.Сумма;
	КонецЦикла;
	
КонецПроцедуры
	
#КонецОбласти      

#КонецЕсли
